src/test/resources/transaction-json/stripe-success-valid-v2022-11-15.json

{
    "id": "evt_ID",
    "object": "event",
    "api_version": "2022-11-15",
    "created": 1671384724,
    "data": {
        "object": {
            "id": "pi_ID",
            "object": "payment_intent",
            "amount": 1000,
            "amount_capturable": 0,
            "amount_details": {
                "tip": {
                }
            },
            "amount_received": 1000,
            "application": null,
            "application_fee_amount": null,
            "automatic_payment_methods": null,
            "canceled_at": null,
            "cancellation_reason": null,
            "capture_method": "automatic",
            "client_secret": "pi_ID_secret_ID",
            "confirmation_method": "automatic",
            "created": 1671384722,
            "currency": "chf",
            "customer": null,
            "description": "1 ticket(s) for event Event Name",
            "invoice": null,
            "last_payment_error": null,
            "latest_charge": "ch_ID",
            "livemode": false,
            "metadata": {
                "fullName": "Test McTest",
                "alfioBaseUrl": "https://alf.io",
                "billingAddress": "Test McTest,Bahnhofstrasse 1,8000 Zürich,Switzerland",
                "reservationId": "RESERVATION_ID",
                "email": "noreply@example.org"
            },
            "next_action": null,
            "on_behalf_of": null,
            "payment_method": "pm_ID",
            "payment_method_options": {
                "card": {
                    "installments": null,
                    "mandate_options": null,
                    "network": null,
                    "request_three_d_secure": "automatic"
                }
            },
            "payment_method_types": [
                "card"
            ],
            "processing": null,
            "receipt_email": null,
            "review": null,
            "setup_future_usage": null,
            "shipping": null,
            "source": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
        }
    },
    "livemode": false,
    "pending_webhooks": 3,
    "request": {
        "id": null,
        "idempotency_key": "pi_ID-src_ID"
    },
    "type": "payment_intent.succeeded"
}